diary/2007/0327-netconf/index.html

<!doctype html>
<html lang="ja" dir="ltr">
  <head>
    <meta charset="utf-8">
    <meta name="robots" content="noindex">
    <title>2007/03/27: netconfで遊んでみる</title>
    <link rel="alternate" type="application/rss+xml" title="rss" href="https://www.don.to/diary/index.rdf">
      <link href="/pagefind/pagefind-ui.css" rel="stylesheet">
    <link href="/stylesheets/code.css" rel="stylesheet" />
    <link href="/stylesheets/photoswipe.css" rel="stylesheet" />
    <link href="/stylesheets/style.css" rel="stylesheet" />
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Inconsolata:wght@200..900&family=Reenie+Beanie&display=swap" rel="stylesheet">
    <link rel="shortcut icon" href="/favicon.ico">
    <link rel="apple-touch-icon" href="/images/ipod-icon.png">
    <meta name="viewport" content="width=device-width, user-scalable=yes, maximum-scale=2.0000">
    <meta property="og:site_name" content="すみかわ日記">
    <meta property="og:title" content="2007/03/27: netconfで遊んでみる">
  </head>

  <body data-source-path="/diary/2007/0327-netconf.html.md.erb">
    <div class="container">
      <div class="centerblock">
          <div class="titleblock">
            <h2><a href="/">すみかわ日記</a></h2>
          </div>
        <div class="mainblock">
          <div id="search"></div>
          <h2 data-pagefind-sort="date:2007-03-27">2007/03/27: netconfで遊んでみる</h2>
          <main data-pagefind-body>
              <p><span class="warning">注: このperlスクリプトは個人的趣味で書いたものです。会社として動作を保証するものではありません。</span></p>

<p>アラクサラのスイッチが<a href="http://itpro.nikkeibp.co.jp/article/COLUMN/20070126/259786/">netconf</a>をサポートしたので、perlで遊んでみました。
netconfサポート機種はAX12/AX24/AX36/AX63/AX67です。</p>

<p>まず、事前準備としてスイッチ側のnetconfを有効にする。</p>

<pre class="terminal">
% ssh operator@10.0.0.1
operator@10.0.0.1's password:

Copyright (c) 2005-2007 ALAXALA Networks Corporation. All rights reserved.

ax36-2.alaxala> en
ax36-2.alaxala# conf t
ax36-2.alaxala(config)# netconf
ax36-2.alaxala(config-netconf)# exit
ax36-2.alaxala(config)# exit
ax36-2.alaxala# exit
Connection to 10.0.0.1 closed.
</pre>

<p>外部接続性があるスイッチでnetconfを有効にするときは、ファイヤウォールやルータでTCP 832番(netconf/soapのポート番号)を落としてセキュリティを確保してください。
SSLで暗号化することも可能ですが、perlスクリプトを改造する必要あり。</p>

<p>次に、AX1230S/AX1240Sを使っている場合は、SOAPエンジンがEnvelope中のattributeの順番を決め打ちしてるので、
SOAP/Lite.pm にこのパッチ(<a href="https://gist.github.com/sumikawa/cf28752abd325292f3d3ef35c6e12574">lite-pm.diff</a>)を当ててください。
<a href="http://www.soaplite.com/">SOAP::Lite</a>がバグってるわけではなくて、AX12側の問題です。
他の機種ではパッチは不要です。</p>

<p>次に、このperlスクリプト(<a href="http://github.com/sumikawa/netconf/blob/8828f73ede8cec8216ab07376b57c204ac4152ac/getconfig.pl">getconf.pl</a>)を実行。
必要なモジュールは適当にインストールしてください。</p>

<pre class="terminal">
% getconf.pl 10.0.0.1

#Last modified by operator at Mon Mar  5 15:03:35 2007 with version 10.4.A
!
hostname "xxxx.alaxala"
clock timezone JST +9
swrt_table_resource l3switch-2
!
ip domain name xxxx.alaxala.net
!
(以下略)
</pre>

<p>で、configとれた。
<a href="http://plagger.org/">Plagger</a>に突っ込めばRSSやメールでdiff通知とかできそう。</p>

<p>流れてるメッセージのトレースは以下。
<a href="http://www.soaplite.com/">SOAP::Lite</a>でdebugトレース取ってるので、一部のHTTPヘッダが見えてないですが。</p>
<div class="highlight"><pre class="highlight plaintext"><code>SOAP::Transport::HTTP::Client::send_receive: POST http://10.0.0.1:832/onapi/ HTTP/1.1
Accept: text/xml
Accept: multipart/*
Accept: application/soap
Content-Length: 726
Content-Type: text/xml; charset=utf-8
SOAPAction: "urn:ietf:params:xml:ns:netconf:base:1.0#hello"

&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;soapenv:Body&gt;&lt;hello xmlns="urn:ietf:params:xml:ns:netconf:base:1.0"&gt;&lt;capabilities&gt;&lt;capability xsi:type="xsd:string"&gt;net:alaxala:oan:onapi:1.1&lt;/capability&gt;&lt;capability xsi:type="xsd:anyURI"&gt;urn:ietf:params:xml:ns:netconf:capability:startup:1.0&lt;/capability&gt;&lt;capability xsi:type="xsd:anyURI"&gt;urn:ietf:params:xml:ns:capability:writable-running:1.0&lt;/capability&gt;&lt;capability xsi:type="xsd:anyURI"&gt;urn:ietf:params:xml:ns:netconf:base:1.0&lt;/capability&gt;&lt;/capabilities&gt;&lt;session-id /&gt;&lt;/hello&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;
SOAP::Transport::HTTP::Client::send_receive: HTTP/1.1 200 OK
Connection: close
Date: Wed, 28 Mar 2007 05:13:04 GMT
Server: Apache/1.3.34 (Unix) mod_ssl/2.8.25 OpenSSL/0.9.7i
Content-Type: text/html
Client-Date: Wed, 28 Mar 2007 05:10:40 GMT
Client-Peer: 10.0.0.1:832
Client-Response-Num: 1
Client-Transfer-Encoding: chunked
Set-Cookie: SESSION_ID=1310,DEVMAC=xx:xx:xx:xx:xx:xx,;

&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
&lt;soapenv:Body&gt;
&lt;hello xmlns="urn:ietf:params:xml:ns:netconf:base:1.0"&gt;
&lt;capabilities&gt;
&lt;capability&gt;
urn:ietf:params:xml:ns:netconf:base:1.0
&lt;/capability&gt;
&lt;capability&gt;
urn:ietf:params:xml:ns:netconf:capability:writable-running:1.0
&lt;/capability&gt;
&lt;capability&gt;
urn:ietf:params:xml:ns:netconf:capability:startup:1.0
&lt;/capability&gt;
&lt;capability&gt;
net:alaxala:oan:onapi:1.1
&lt;/capability&gt;
&lt;/capabilities&gt;
&lt;session-id&gt;1310&lt;/session-id&gt;
&lt;/hello&gt;
&lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
SOAP::Transport::HTTP::Client::send_receive: POST http://10.0.0.1:832/onapi/ HTTP/1.1
Accept: text/xml
Accept: multipart/*
Accept: application/soap
User-Agent: SOAP::Lite/Perl/0.69
Content-Length: 404
Content-Type: text/xml; charset=utf-8
SOAPAction: "urn:ietf:params:xml:ns:netconf:base:1.0#rpc"

&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;soapenv:Body&gt;&lt;rpc xmlns="urn:ietf:params:xml:ns:netconf:base:1.0"&gt;&lt;rpc message-id="1234++"&gt;&lt;get-config&gt;&lt;source&gt;&lt;running /&gt;&lt;/source&gt;&lt;/get-config&gt;&lt;/rpc&gt;&lt;/rpc&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;
SOAP::Transport::HTTP::Client::send_receive: HTTP/1.1 200 OK
Connection: close
Date: Wed, 28 Mar 2007 05:13:04 GMT
Server: Apache/1.3.34 (Unix) mod_ssl/2.8.25 OpenSSL/0.9.7i
Content-Type: text/html
Client-Date: Wed, 28 Mar 2007 05:10:40 GMT
Client-Peer: 10.0.0.1:832
Client-Response-Num: 1
Client-Transfer-Encoding: chunked
Set-Cookie: SESSION_ID=1310,DEVMAC=xx:xx:xx:xx:xx:xx,;

&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
&lt;soapenv:Body&gt;
&lt;rpc-reply xmlns="urn:ietf:params:xml:ns:netconf:base:1.0"&gt;
&lt;rpc-reply message-id="1234"&gt;
&lt;data&gt;
&lt;ns1:ConfigData xmlns:ns1="urn:net:alaxala:oan:onapi:commons:netmod:1.0"&gt;
#Last modified by operator at Mon Mar  5 15:03:35 2007 with version 10.4.A
!
hostname &amp;quot;xxxx.alaxala&amp;quot;
clock timezone JST +9
swrt_table_resource l3switch-2
!
(snip)
&lt;/ns1:ConfigData&gt;
&lt;/data&gt;
&lt;/rpc-reply&gt;
&lt;/rpc-reply&gt;
&lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre></div>
<p>netconfのWSDLがあるので本当は下位関数作る必要ないのですが、
<a href="http://www.soaplite.com/">SOAP::Lite</a>のWSDLスキーマ読み込みがまだいけてないので、テマテマと関数書いてます。</p>



              <div class="tags">
                Tags:
                  <a href="/tag/netconf/">netconf</a> (2)
                  <a href="/tag/networking/">networking</a> (16)
                  <a href="/tag/perl/">perl</a> (2)
              </div>
          </main>

          <nav class="prev_next" style="text-align: center; margin: 1em 0;"><a href="/diary/2007/0323-walk/">&laquo; prev</a><span style="margin: 0 1em;">|</span><a href="/diary/2007/0327-walk/">next &raquo;</a></nav>

          <hr>
          <div id="name">SUMIKAWA Munechika / Daydreamers On the Net</div>
        </div>
      </div>
      <div class="leftblock">
        <div class="eachindexblock nav">
  <ul id="gray">
      <li> <a href="/diary/2026.html">2026年</a></li>
      <li> <a href="/diary/2025.html">2025年</a></li>
      <li> <a href="/diary/2024.html">2024年</a></li>
      <li> <a href="/diary/2023.html">2023年</a></li>
      <li> <a href="/diary/2022.html">2022年</a></li>
      <li> <a href="/diary/2021.html">2021年</a></li>
      <li> <a href="/diary/2020.html">2020年</a></li>
      <li> <a href="/diary/2019.html">2019年</a></li>
      <li> <a href="/diary/2018.html">2018年</a></li>
      <li> <a href="/diary/2017.html">2017年</a></li>
      <li> <a href="/diary/2016.html">2016年</a></li>
      <li> <a href="/diary/2015.html">2015年</a></li>
      <li> <a href="/diary/2014.html">2014年</a></li>
      <li> <a href="/diary/2013.html">2013年</a></li>
      <li> <a href="/diary/2012.html">2012年</a></li>
      <li> <a href="/diary/2011.html">2011年</a></li>
      <li> <a href="/diary/2010.html">2010年</a></li>
      <li> <a href="/diary/2009.html">2009年</a></li>
      <li> <a href="/diary/2008.html">2008年</a></li>
      <li> <a href="/diary/2007.html">2007年</a></li>
      <li> <a href="/diary/2006.html">2006年</a></li>
      <li> <a href="/diary/2005.html">2005年</a></li>
      <li> <a href="/diary/2004.html">2004年</a></li>
      <li> <a href="/diary/2003.html">2003年</a></li>
      <li> <a href="/diary/2002.html">2002年</a></li>
      <li> <a href="/diary/2001.html">2001年</a></li>
      <li> <a href="/diary/2000.html">2000年</a></li>
      <li> <a href="/diary/1999.html">1999年</a></li>
      <li> <a href="/diary/1998.html">1998年</a></li>
      <li> <a href="/diary/1997.html">1997年</a></li>
      <li> <a href="/diary/1996.html">1996年</a></li>
    <li> <a href="/diary/1995.html">1995年以前</a></li>
    <li> <a href="/tag/tag_list/">Tags</a></li>
  </ul>
</div>

      </div>
      <div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">
    <div class="pswp__bg"></div>
    <div class="pswp__scroll-wrap">
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>
        <div class="pswp__ui pswp__ui--hidden">
            <div class="pswp__top-bar">
                <div class="pswp__counter"></div>
                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>
                <button class="pswp__button pswp__button--share" title="Share"></button>
                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>
                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div>
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>
        </div>
    </div>
</div>

    </div>
    <script src="/javascripts/diary.js"></script>
      <script src="/pagefind/pagefind-ui.js"></script>
      <script src="/javascripts/search.js"></script>
    <script src="/javascripts/photoswipe.umd.min.js"></script>
    <script src="/javascripts/photoswipe-init.js"></script>
    <script src="https://cdn.jsdelivr.net/npm/mermaid@10.5.0/dist/mermaid.min.js"></script>

  </body>
</html>
